**** Solution
     #+BEGIN_SRC C :results verbatim :exports both
     void *joinSelf(void *arg) {
         printf("%p\n", arg);
         int s = pthread_join(pthread_self(), NULL);
         if (s != 0) errExitEN(s, "joinSelf failed: pthread_join");
         return (void *) 1;
     }


     pthread_t t1;
     int s;

     printf("Starting Thread 1\n");
     s = pthread_create(&t1, NULL, joinSelf, (int*) 0);
     if (s != 0) errExitEN(s, "pthread_create");

     sleep(10); // ensure the thread can run before program termination
     #+END_SRC

     #+RESULTS:
     : ERROR [EDEADLK/EDEADLOCK Resource deadlock avoided] joinSelf failed: pthread_join

*** Simple Thread Creation
    #+BEGIN_SRC C :results pp :exports both
    void * threadFunc(void *arg)
    {
        char *s = (char *) arg;
        printf("%s", s);
        return (void *) strlen(s);
    }
  
    pthread_t t1;
    void *res;
    int s;
    
    s = pthread_create(&t1, NULL, threadFunc, "Hello world \n");
    if (s != 0) errExitEN(s, "pthread_create");

    printf("Message from main()\n");
    s = pthread_join(t1, &res);
    if (s != 0) errExitEN(s, "pthread_join ");
  
    printf("Thread returned %ld\n", (long) res);
    #+END_SRC 

    #+RESULTS:
    : Message from main()
    : Hello world 
    : Thread returned 13
